In [27]:
import pandas as pd
import numpy as np

In [21]:
lst = ['Machine', 'Learning', 'Lab', 'Devrishi', 
       'Sikka', '21BCE1036', 'VIT', 'Chennai']

df = pd.DataFrame(lst, columns=['Words'])
print(df)

       Words
0    Machine
1   Learning
2        Lab
3   Devrishi
4      Sikka
5  21BCE1036
6        VIT
7    Chennai

In [28]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [29]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [29, 35, 31, 28],
        'Address': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
        'Qualification': ['MBA', 'BS', 'MS', 'PhD']}
 
df = pd.DataFrame(data)
 
print(df[['Name', 'Qualification', 'Address']])

      Name Qualification      Address
0    Alice           MBA     New York
1      Bob            BS  Los Angeles
2  Charlie            MS      Chicago
3    David           PhD      Houston

In [24]:
data = pd.read_csv("character-deaths.csv", index_col ="Name")
 
first = data.loc["Bannen"]
second = data.loc["Gariss"]
 
 
print(first, "\n\n\n", second)

Allegiances           Night's Watch
Death Year                    299.0
Book of Death                   3.0
Death Chapter                  33.0
Book Intro Chapter              0.0
Gender                            1
Nobility                          0
GoT                               0
CoK                               0
SoS                               1
FfC                               0
DwD                               0
Name: Bannen, dtype: object


 Allegiances           House Stark
Death Year                    NaN
Book of Death                 NaN
Death Chapter                 NaN
Book Intro Chapter           50.0
Gender                          1
Nobility                        0
GoT                             0
CoK                             1
SoS                             0
FfC                             0
DwD                             0
Name: Gariss, dtype: object

In [25]:
data = pd.read_csv("character-deaths.csv", index_col ="Name")
 
first = data["Allegiances"]
 
print(first)

Name
Addam Marbrand                   Lannister
Aegon Frey (Jinglebell)                NaN
Aegon Targaryen            House Targaryen
Adrack Humble                House Greyjoy
Aemon Costayne                   Lannister
                                ...
Zollo                                  NaN
Yurkhaz zo Yunzak                      NaN
Yezzan Zo Qaggaz                       NaN
Torwynd the Tame                  Wildling
Talbert Serry                       Tyrell
Name: Allegiances, Length: 917, dtype: object

In [26]:
data = pd.read_csv("character-deaths.csv", index_col ="Name")

row2 = data.iloc[0] 
 
print(row2)

Allegiances           Lannister
Death Year                  NaN
Book of Death               NaN
Death Chapter               NaN
Book Intro Chapter         56.0
Gender                        1
Nobility                      1
GoT                           1
CoK                           1
SoS                           1
FfC                           1
DwD                           0
Name: Addam Marbrand, dtype: object

<h2 style="font-family:monospace;">To check for missing values in a Pandas DataFrame, use isnull() and notnull(). These 
functions identify NaN values in both DataFrames and Series.</h2>

In [31]:
data = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}

df = pd.DataFrame(data)

print(df)

df.isnull()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

<h2 >Filling missing values using fillna(), replace() and interpolate():</h2>

In [46]:
data = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}

df = pd.DataFrame(data)

df_fillna = df.fillna(0)

df_replace = df.replace(np.nan, -1)

df_interpolate = df.interpolate()

print("Original Dataframe\n\", df)
print("DataFrame with fillna():\n", df_fillna, "\n")
print("DataFrame with replace():\n", df_replace, "\n")
print("DataFrame with interpolate():\n", df_interpolate)

Original Dataframe

    First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0
DataFrame with fillna():
    First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

DataFrame with replace():
    First Score  Second Score  Third Score
0        100.0          30.0         -1.0
1         90.0          45.0         40.0
2         -1.0          56.0         80.0
3         95.0          -1.0         98.0

DataFrame with interpolate():
    First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         92.5          56.0         80.0
3         95.0          56.0         98.0

In [50]:
data = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98],
        'Fourth Score':[52, 40, 80, 98],
}
 
df = pd.DataFrame(data)
 
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
1         90.0          45.0         40.0            40

<h2>Iterating over rows :</h2>

In [53]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [29, 35, 31, 28],
        'Address': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
        'Qualification': ['MBA', 'BS', 'MS', 'PhD']}

df = pd.DataFrame(data)

print(df)

      Name  Age      Address Qualification
0    Alice   29     New York           MBA
1      Bob   35  Los Angeles            BS
2  Charlie   31      Chicago            MS
3    David   28      Houston           PhD

In [54]:
for i, j in df.iterrows():
    print(i, j)
    print()

0 Name                Alice
Age                    29
Address          New York
Qualification         MBA
Name: 0, dtype: object

1 Name                     Bob
Age                       35
Address          Los Angeles
Qualification             BS
Name: 1, dtype: object

2 Name             Charlie
Age                   31
Address          Chicago
Qualification         MS
Name: 2, dtype: object

3 Name               David
Age                   28
Address          Houston
Qualification        PhD
Name: 3, dtype: object

<h2>Iterating over Columns :</h2>

In [57]:
columns = list(df)
 
for i in columns:
    print (df[i][1])

Bob
35
Los Angeles
BS

In [61]:
df2 = pd.read_csv("character-deaths.csv")

<h2><bold>.head()</bold> displays the first five rows of the DataFrame.</h2>

In [63]:
df2.head()

,Name,Allegiances,Death Year,Book of Death,Death Chapter,Book Intro Chapter,Gender,Nobility,GoT,CoK,SoS,FfC,DwD
0,Addam Marbrand,Lannister,NaN,NaN,NaN,56.0,1,1,1,1,1,1,0
1,Aegon Frey (Jinglebell),NaN,299.0,3.0,51.0,49.0,1,1,0,0,1,0,0
2,Aegon Targaryen,House Targaryen,NaN,NaN,NaN,5.0,1,1,0,0,0,0,1
3,Adrack Humble,House Greyjoy,300.0,5.0,20.0,20.0,1,1,0,0,0,0,1
4,Aemon Costayne,Lannister,NaN,NaN,NaN,NaN,1,1,0,0,1,0,0

<h2><bold>.tail()</bold> displays the last five rows of the DataFrame.</h2>

In [59]:
df2.tail()

,Name,Allegiances,Death Year,Book of Death,Death Chapter,Book Intro Chapter,Gender,Nobility,GoT,CoK,SoS,FfC,DwD
912,Zollo,NaN,NaN,NaN,NaN,21.0,1,0,0,0,1,0,0
913,Yurkhaz zo Yunzak,NaN,300.0,5.0,59.0,47.0,1,0,0,0,0,0,1
914,Yezzan Zo Qaggaz,NaN,300.0,5.0,57.0,25.0,1,1,0,0,0,0,1
915,Torwynd the Tame,Wildling,300.0,5.0,73.0,73.0,1,0,0,0,1,0,0
916,Talbert Serry,Tyrell,300.0,4.0,29.0,29.0,1,1,0,0,0,1,0

In [67]:
print("Type:\n",type(df2))
print("Information about the dataframe:",df2.info)

Type:
 <class 'pandas.core.frame.DataFrame'>
Information about the dataframe: <bound method DataFrame.info of                         Name      Allegiances  Death Year  Book of Death  \
0             Addam Marbrand        Lannister         NaN            NaN
1    Aegon Frey (Jinglebell)              NaN       299.0            3.0
2            Aegon Targaryen  House Targaryen         NaN            NaN
3              Adrack Humble    House Greyjoy       300.0            5.0
4             Aemon Costayne        Lannister         NaN            NaN
..                       ...              ...         ...            ...
912                    Zollo              NaN         NaN            NaN
913        Yurkhaz zo Yunzak              NaN       300.0            5.0
914         Yezzan Zo Qaggaz              NaN       300.0            5.0
915         Torwynd the Tame         Wildling       300.0            5.0
916            Talbert Serry           Tyrell       300.0            4.0

     Death Chapter  Book Intro Chapter  Gender  Nobility  GoT  CoK  SoS  FfC  \
0              NaN                56.0       1         1    1    1    1    1
1             51.0                49.0       1         1    0    0    1    0
2              NaN                 5.0       1         1    0    0    0    0
3             20.0                20.0       1         1    0    0    0    0
4              NaN                 NaN       1         1    0    0    1    0
..             ...                 ...     ...       ...  ...  ...  ...  ...
912            NaN                21.0       1         0    0    0    1    0
913           59.0                47.0       1         0    0    0    0    0
914           57.0                25.0       1         1    0    0    0    0
915           73.0                73.0       1         0    0    0    1    0
916           29.0                29.0       1         1    0    0    0    1

     DwD
0      0
1      0
2      1
3      1
4      0
..   ...
912    0
913    1
914    1
915    0
916    0

[917 rows x 13 columns]>

In [68]:
print("Shape of datafframe:",df2.shape)
df2.drop_duplicates()
print(df2.shape)

Shape of datafframe: (917, 13)
(917, 13)

In [71]:
print("Columns of dataframe:\t",df2.columns)

Columns of dataframe:	 Index(['Name', 'Allegiances', 'Death Year', 'Book of Death', 'Death Chapter',
       'Book Intro Chapter', 'Gender', 'Nobility', 'GoT', 'CoK', 'SoS', 'FfC',
       'DwD'],
      dtype='object')

In [73]:
print(df2.describe())

       Death Year  Book of Death  Death Chapter  Book Intro Chapter  \
count  305.000000     307.000000     299.000000          905.000000
mean   299.157377       2.928339      40.070234           28.861878
std      0.703483       1.326482      20.470270           20.165788
min    297.000000       1.000000       0.000000            0.000000
25%    299.000000       2.000000      25.500000           11.000000
50%    299.000000       3.000000      39.000000           27.000000
75%    300.000000       4.000000      57.000000           43.000000
max    300.000000       5.000000      80.000000           80.000000

           Gender    Nobility         GoT         CoK         SoS         FfC  \
count  917.000000  917.000000  917.000000  917.000000  917.000000  917.000000
mean     0.828790    0.468920    0.272628    0.353326    0.424209    0.272628
std      0.376898    0.499305    0.445554    0.478264    0.494492    0.445554
min      0.000000    0.000000    0.000000    0.000000    0.000000    0.000000
25%      1.000000    0.000000    0.000000    0.000000    0.000000    0.000000
50%      1.000000    0.000000    0.000000    0.000000    0.000000    0.000000
75%      1.000000    1.000000    1.000000    1.000000    1.000000    1.000000
max      1.000000    1.000000    1.000000    1.000000    1.000000    1.000000

              DwD
count  917.000000
mean     0.284624
std      0.451481
min      0.000000
25%      0.000000
50%      0.000000
75%      1.000000
max      1.000000